; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph6 - mode
	infrared3 - mode
	image2 - mode
	thermograph4 - mode
	infrared1 - mode
	thermograph0 - mode
	spectrograph5 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation1 - direction
	Star4 - direction
	Star2 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph6)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph5)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
)
(:goal (and
	(have_image Star6 spectrograph6)
	(have_image Star6 infrared3)
	(have_image Star7 image2)
	(have_image Star7 spectrograph5)
	(have_image Phenomenon8 thermograph4)
	(have_image Phenomenon9 spectrograph5)
	(have_image Star10 spectrograph5)
	(have_image Phenomenon11 thermograph4)
	(have_image Phenomenon11 spectrograph5)
	(have_image Planet12 infrared3)
	(have_image Planet13 image2)
	(have_image Planet13 spectrograph5)
))

)

; plan
1. (turn_to satellite0 groundstation1 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   goals met: 0 of 12
5. (take_image satellite0 star6 instrument0 spectrograph6)
   added: (have_image star6 spectrograph6)
   goals met: 1 of 12
6. (take_image satellite0 star6 instrument0 infrared3)
   added: (have_image star6 infrared3)
   goals met: 2 of 12
7. (turn_to satellite0 planet12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet12)
   goals met: 2 of 12
8. (take_image satellite0 planet12 instrument0 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 3 of 12
9. (turn_to satellite0 phenomenon8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 12
10. (take_image satellite0 phenomenon8 instrument0 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 4 of 12
11. (turn_to satellite0 phenomenon11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 12
12. (take_image satellite0 phenomenon11 instrument0 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 5 of 12
13. (turn_to satellite0 star2 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star2)
   goals met: 5 of 12
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 12
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 12
16. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 5 of 12
17. (turn_to satellite0 phenomenon11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 12
18. (take_image satellite0 phenomenon11 instrument1 spectrograph5)
   added: (have_image phenomenon11 spectrograph5)
   goals met: 6 of 12
19. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 12
20. (take_image satellite0 phenomenon9 instrument1 spectrograph5)
   added: (have_image phenomenon9 spectrograph5)
   goals met: 7 of 12
21. (turn_to satellite0 planet13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet13)
   goals met: 7 of 12
22. (take_image satellite0 planet13 instrument1 image2)
   added: (have_image planet13 image2)
   goals met: 8 of 12
23. (take_image satellite0 planet13 instrument1 spectrograph5)
   added: (have_image planet13 spectrograph5)
   goals met: 9 of 12
24. (turn_to satellite0 star10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star10)
   goals met: 9 of 12
25. (take_image satellite0 star10 instrument1 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 10 of 12
26. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 10 of 12
27. (take_image satellite0 star7 instrument1 image2)
   added: (have_image star7 image2)
   goals met: 11 of 12
28. (take_image satellite0 star7 instrument1 spectrograph5)
   added: (have_image star7 spectrograph5)
   goals met: 12 of 12
